Keyrim/drone-mark4/software/components/platform/src/stm32/board.cpp
#include "platform_stm32/board.hpp"

#include <cstddef>
#include <cstdint>

#include <stm32f405xx.h>

#include "transport/node_id.hpp"

namespace mark4
{
    namespace
    {
        // Main PLL: 8 MHz HSE / M=4 -> 2 MHz comparison frequency, * N=168
        // -> 336 MHz VCO, / P=2 (PLLP bits left at 00) -> 168 MHz SYSCLK,
        // / Q=7 -> 48 MHz for the USB/SDIO domain (unused but kept in spec).
        constexpr std::uint32_t PLL_M = 4U;
        constexpr std::uint32_t PLL_N = 168U;
        constexpr std::uint32_t PLL_Q = 7U;

        /// Poll budget for HSE/PLL ready flags: worst-case crystal startup
        /// is a few ms, this is well above 100 ms on the 16 MHz boot clock.
        constexpr std::uint32_t READY_TIMEOUT_LOOPS = 500000U;

        constexpr std::uint32_t LED1_PIN = 13U;
        constexpr std::uint32_t LED2_PIN = 14U;
        constexpr std::uint32_t GPIO_MODER_OUTPUT = 1U;

        /// Core clock the rest of the code trusts; HSI until the PLL is up.
        std::uint32_t g_coreClockHz = HSI_CLOCK_HZ;

        /// @brief Polls a register until (reg & mask) == expected.
        /// @param reg register to poll
        /// @param mask bits compared
        /// @param expected value the masked bits must reach
        /// @return true when the value was reached before the poll budget ran out
        bool waitMasked(volatile std::uint32_t &reg, std::uint32_t mask, std::uint32_t expected)
        {
            for (std::uint32_t loop = 0U; loop < READY_TIMEOUT_LOOPS; ++loop)
            {
                if ((reg & mask) == expected)
                {
                    return true;
                }
            }
            return false;
        }
    } // namespace

    bool initSystemClock()
    {
        RCC->CR = RCC->CR | RCC_CR_HSEON;
        if (!waitMasked(RCC->CR, RCC_CR_HSERDY, RCC_CR_HSERDY))
        {
            return false;
        }

        // 5 wait states (168 MHz at 3.3 V), prefetch and both caches on.
        // The voltage regulator stays on its reset scale 1, which allows
        // 168 MHz without touching PWR.
        FLASH->ACR = FLASH_ACR_LATENCY_5WS | FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN;

        // Bus prescalers: AHB /1 (168 MHz), APB1 /4 (42 MHz, its 45 MHz
        // max), APB2 /2 (84 MHz, its 90 MHz max).
        RCC->CFGR = RCC_CFGR_PPRE1_DIV4 | RCC_CFGR_PPRE2_DIV2;

        RCC->PLLCFGR = (PLL_M << RCC_PLLCFGR_PLLM_Pos) | (PLL_N << RCC_PLLCFGR_PLLN_Pos) |
                       RCC_PLLCFGR_PLLSRC_HSE | (PLL_Q << RCC_PLLCFGR_PLLQ_Pos);
        RCC->CR = RCC->CR | RCC_CR_PLLON;
        if (!waitMasked(RCC->CR, RCC_CR_PLLRDY, RCC_CR_PLLRDY))
        {
            return false;
        }

        RCC->CFGR = (RCC->CFGR & ~RCC_CFGR_SW_Msk) | RCC_CFGR_SW_PLL;
        if (!waitMasked(RCC->CFGR, RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_PLL))
        {
            return false;
        }

        g_coreClockHz = CORE_CLOCK_HZ;
        return true;
    }

    std::uint32_t coreClockHz()
    {
        return g_coreClockHz;
    }

    void initCycleCounter()
    {
        CoreDebug->DEMCR = CoreDebug->DEMCR | CoreDebug_DEMCR_TRCENA_Msk;
        DWT->CYCCNT = 0U;
        DWT->CTRL = DWT->CTRL | DWT_CTRL_CYCCNTENA_Msk;
    }

    void delayMs(std::uint32_t milliseconds)
    {
        // One millisecond per inner wait keeps the 32-bit cycle math exact
        // for arbitrarily long delays (the counter wraps every ~25 s).
        const std::uint32_t cyclesPerMs = g_coreClockHz / 1000U;
        for (std::uint32_t elapsed = 0U; elapsed < milliseconds; ++elapsed)
        {
            const std::uint32_t start = DWT->CYCCNT;
            while (DWT->CYCCNT - start < cyclesPerMs)
            {
            }
        }
    }

    void initLeds()
    {
        RCC->AHB1ENR = RCC->AHB1ENR | RCC_AHB1ENR_GPIOCEN;

        constexpr std::uint32_t MODE_MASK = (3U << (2U * LED1_PIN)) | (3U << (2U * LED2_PIN));
        constexpr std::uint32_t MODE_OUTPUT =
            (GPIO_MODER_OUTPUT << (2U * LED1_PIN)) | (GPIO_MODER_OUTPUT << (2U * LED2_PIN));
        GPIOC->MODER = (GPIOC->MODER & ~MODE_MASK) | MODE_OUTPUT;
    }

    void toggleLed1()
    {
        GPIOC->ODR = GPIOC->ODR ^ (1U << LED1_PIN);
    }

    void setLed1(bool on)
    {
        // BSRR: low half sets the pin, high half resets it, atomically.
        GPIOC->BSRR = on ? (1U << LED1_PIN) : (1U << (LED1_PIN + 16U));
    }

    void setLed2(bool on)
    {
        GPIOC->BSRR = on ? (1U << LED2_PIN) : (1U << (LED2_PIN + 16U));
    }

    void setVectorTable(std::uint32_t address)
    {
        SCB->VTOR = address;
        // The core may already have prefetched past this point; the barriers
        // make the new table current before any exception can be taken.
        __DSB();
        __ISB();
    }

    void systemReset()
    {
        // Barrier, VECTKEY + SYSRESETREQ into AIRCR, then spin: the reset
        // itself is asynchronous, so wait for it.
        NVIC_SystemReset();
    }

    std::uint32_t boardNodeId()
    {
        // The 96-bit unique device id of the F405 (RM0090 39.1), read as
        // bytes so the hash does not depend on the word order.
        constexpr std::size_t UID_SIZE = 12U;
        return hashNodeId(reinterpret_cast<const std::uint8_t *>(UID_BASE), UID_SIZE);
    }
} // namespace mark4
